import pandas as pd


matches = [
    'Манчестер Сити 3-1 Ливерпуль',
    'Челси 2-0 Манчестер Юнайтед',
    'Тоттенхэм 1-1 Арсенал',
    'Лестер Сити 4-2 Эвертон',
    'Вулвергемптон 2-0 Астон Вилла',
    'Саутгемптон 1-1 Кристал Пэлас',
    'Ньюкасл Юнайтед 3-2 Брайтон',
    'Бернли 0-3 Фулхэм',
    'Вест Бромвич Альбион 1-4 Шеффилд Юнайтед',
    'Арсенал 2-1 Манчестер Юнайтед',
    'Ливерпуль 3-0 Челси',
    'Манчестер Сити 4-1 Тоттенхэм',
    'Эвертон 1-2 Лестер Сити',
    'Астон Вилла 2-2 Вулвергемптон',
    'Кристал Пэлас 0-0 Саутгемптон',
    'Брайтон 1-1 Ньюкасл Юнайтед',
    'Фулхэм 2-0 Бернли',
    'Шеффилд Юнайтед 2-2 Вест Бромвич Альбион',
    'Манчестер Юнайтед 3-2 Арсенал',
    'Ливерпуль 2-0 Манчестер Сити',
    'Челси 1-1 Тоттенхэм',
    'Лестер Сити 3-1 Эвертон',
    'Вулвергемптон 1-0 Астон Вилла',
    'Саутгемптон 2-1 Кристал Пэлас',
    'Ньюкасл Юнайтед 1-0 Брайтон',
    'Бернли 1-2 Фулхэм',
    'Вест Бромвич Альбион 0-3 Шеффилд Юнайтед',
    'Арсенал 3-1 Ливерпуль',
    'Манчестер Сити 2-0 Челси',
    'Тоттенхэм 2-2 Лестер Сити',
    'Эвертон 2-1 Вулвергемптон',
    'Астон Вилла 3-1 Саутгемптон',
    'Кристал Пэлас 1-0 Ньюкасл Юнайтед',
    'Брайтон 0-2 Фулхэм',
    'Шеффилд Юнайтед 2-1 Бернли',
    'Манчестер Юнайтед 2-0 Арсенал',
    'Ливерпуль 1-0 Манчестер Сити',
    'Челси 2-1 Тоттенхэм',
    'Лестер Сити 2-0 Эвертон',
    'Вулвергемптон 1-1 Астон Вилла',
    'Саутгемптон 1-0 Кристал Пэлас',
    'Ньюкасл Юнайтед 2-2 Брайтон',
    'Фулхэм 1-1 Вест Бромвич Альбион',
    'Шеффилд Юнайтед 0-0 Арсенал',
    'Бернли 0-3 Ливерпуль',
    'Манчестер Сити 3-1 Челси',
    'Тоттенхэм 2-1 Лестер Сити',
    'Эвертон 3-0 Вулвергемптон',
    'Астон Вилла 2-1 Саутгемптон',
    'Кристал Пэлас 1-0 Ньюкасл Юнайтед',
    'Брайтон 1-1 Фулхэм',
    'Вест Бромвич Альбион 1-2 Шеффилд Юнайтед',
    'Арсенал 2-2 Манчестер Юнайтед',
    'Ливерпуль 4-0 Челси',
    'Манчестер Сити 2-1 Тоттенхэм',
    'Лестер Сити 1-1 Эвертон',
    'Вулвергемптон 2-0 Астон Вилла',
    'Саутгемптон 2-2 Кристал Пэлас',
    'Ньюкасл Юнайтед 1-1 Брайтон',
    'Фулхэм 2-1 Шеффилд Юнайтед',
    'Бернли 1-0 Вест Бромвич Альбион',
    'Манчестер Юнайтед 3-0 Арсенал',
    'Ливерпуль 2-1 Манчестер Сити',
    'Челси 2-0 Тоттенхэм',
    'Лестер Сити 3-2 Эвертон',
    'Вулвергемптон 2-1 Астон Вилла',
    'Саутгемптон 1-1 Кристал Пэлас',
    'Ньюкасл Юнайтед 2-0 Брайтон',
    'Фулхэм 2-0 Вест Бромвич Альбион',
    'Шеффилд Юнайтед 1-1 Арсенал',
    'Бернли 0-2 Ливерпуль',
    'Манчестер Сити 4-0 Челси',
    'Тоттенхэм 1-0 Лестер Сити',
    'Эвертон 2-2 Вулвергемптон',
    'Астон Вилла 3-0 Саутгемптон',
    'Кристал Пэлас 1-0 Ньюкасл Юнайтед',
    'Брайтон 1-2 Фулхэм',
    'Вест Бромвич Альбион 0-1 Шеффилд Юнайтед',
    'Арсенал 1-1 Манчестер Юнайтед',
    'Ливерпуль 3-1 Челси',
    'Манчестер Сити 2-2 Тоттенхэм',
    'Лестер Сити 2-1 Эвертон',
    'Вулвергемптон 3-0 Астон Вилла',
    'Саутгемптон 1-0 Кристал Пэлас',
    'Ньюкасл Юнайтед 1-0 Брайтон',
    'Фулхэм 3-1 Шеффилд Юнайтед',
    'Бернли 1-1 Вест Бромвич Альбион',
    'Манчестер Юнайтед 4-0 Арсенал',
    'Ливерпуль 2-0 Манчестер Сити',
    'Челси 2-1 Тоттенхэм',
    'Лестер Сити 3-0 Эвертон',
    'Вулвергемптон 1-0 Астон Вилла',
    'Саутгемптон 1-1 Кристал Пэлас',
    'Ньюкасл Юнайтед 2-0 Брайтон',
    'Фулхэм 2-0 Вест Бромвич Альбион',
    'Шеффилд Юнайтед 2-1 Арсенал',
    'Бернли 0-3 Ливерпуль',
]
comands = {}
for row in matches:
    c_1, c_2 = row.split("-")
    coma_1, coma_2 = c_1[:-2], c_2[2:]
    res_1, res_2 = int(c_1[-1:]), int(c_2[:1])
    if res_1 == res_2:
        point_1 = point_2 = 1
    else:
        point_1 = 3 if res_1 > res_2 else 0
        point_2 = 3 if res_2 > res_1 else 0
    get_1 = comands.get(coma_1, [0, 0, 0, 0, 0])
    get_2 = comands.get(coma_2, [0, 0, 0, 0, 0])
    comands[coma_1] = [get_1[0] + 1, 
                       get_1[1] + 1 if point_1 == 3 else get_1[1], 
                       get_1[2] + 1 if point_1 == 1 else get_1[2],
                       get_1[3] + 1 if point_1 == 0 else get_1[3],
                       get_1[4] + point_1
                      ]
    comands[coma_2] = [get_2[0] + 1, 
                       get_2[1] + 1 if point_2 == 3 else get_2[1], 
                       get_2[2] + 1 if point_2 == 1 else get_2[2],
                       get_2[3] + 1 if point_2 == 0 else get_2[3],
                       get_2[4] + point_2
                      ]
del get_1, get_2,
coma_1, coma_2, point_1, point_2, 
res_1, res_2, c_1, c_2, row

table = {}
for team, val in comands.items():
    table["Команда"] = (table.get("Команда", "")) + (str(team)) + "_"
    table["Игры"] = (table.get("Игры", "")) + (str(val[0])) + "_"
    table["Победы"] = (table.get("Победы", "")) + (str(val[1])) + "_"
    table["Ничьи"] = (table.get("Ничьи", "")) + (str(val[2])) + "_"
    table["Поражения"] = (table.get("Поражения", "")) + (str(val[3])) + "_"
    table["Очки"] = (table.get("Очки", "")) + (str(val[4])) + "_"

for key, val in table.items():
    table[key] = tuple(filter(lambda el: el, map(str.strip, val.split("_"))))
    

table["Очки"] = list(map(int, table["Очки"]))
table["Победы"] = list(map(int, table["Победы"]))
df = pd.DataFrame(table)
df.sort_values(by="Команда", ascending=False, inplace=True)
df.sort_values(by="Победы", ascending=False, inplace=True)
df.sort_values(by="Очки", ascending=False, inplace=True)
df.to_csv("Pandas_csv_reading/Table.csv", index=False)


df.fff = "fff"
print(type(df.fff))